Revit 2026 API

# GeometryCreationUtilities Methods

---

The GeometryCreationUtilities type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollectionVertexPair) |  |
|  | CreateBlendGeometry(CurveLoop, CurveLoop, ICollectionVertexPair, SolidOptions) |  |
|  | CreateExtrusionGeometry(IListCurveLoop, XYZ, Double) |  |
|  | CreateExtrusionGeometry(IListCurveLoop, XYZ, Double, SolidOptions) |  |
|  | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, XYZ) |  |
|  | CreateFixedReferenceSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, XYZ, SolidOptions) |  |
|  | CreateLoftGeometry |  |
|  | CreateRevolvedGeometry(Frame, IListCurveLoop, Double, Double) |  |
|  | CreateRevolvedGeometry(Frame, IListCurveLoop, Double, Double, SolidOptions) |  |
|  | CreateSweptBlendGeometry(Curve, IListDouble, IListCurveLoop, IListICollectionVertexPair) |  |
|  | CreateSweptBlendGeometry(Curve, IListDouble, IListCurveLoop, IListICollectionVertexPair, SolidOptions) |  |
|  | CreateSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop) |  |
|  | CreateSweptGeometry(CurveLoop, Int32, Double, IListCurveLoop, SolidOptions) |  |

#### Reference

GeometryCreationUtilities Class

Autodesk.Revit.DB Namespace